InformationRegisters/ГруппыАналогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГруппыАналогов</Name>
			<Comment>Группы аналогов номенклатуры</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Comment>Наименование аналога</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйПоГруппе</Name>
					<Comment>Признак главного аналога для группы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйПоПроизводителю</Name>
					<Comment>Признак главного по производителю для группы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>№ номенклатуры по каталогу</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторГруппы</Name>
					<Comment>Идентификатор группы аналогов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АртикулДляПоиска</Name>
					<Comment>№ артикула для поиска</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Comment>Производитель детали</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Comment>Номенклатура</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеИностранное</Name>
					<Comment>Иностранное наименование</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Код производителя</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Comment>Тип номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Comment>Вид номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Comment>Базовая единица измерения номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяЕдиницаИзмерения</Name>
					<Comment>Основная единица измерения номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Comment>Используется для ведения дополнительного учета валютной себестоимости и цен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределенияДопРасходов</Name>
					<Comment>Заполняется только для услуг и управляет распределением суммы по услуге в пределах документа</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРаспределенияДопРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДопРасходов</Name>
					<Comment>Заполняется для услуг. По этой статье происходит начисление расходов / доходов при поставке / отгрузке</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Comment>Страна происхождения по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХраненияТовара</Name>
					<Comment>(в днях) из конфигурации Торговый Комплекс</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Comment>Процент наценки по умолчанию (для расчета цен)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Comment>Производитель товара</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаАвтокаталога</Name>
					<Comment>Индекс картинки номенклатуры в автокаталоге</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаНДСПоРеализации</Name>
					<Comment>Счет учета НДС по реализации используется при выгрузке в бухгалтерию</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Регламентированный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьПоставок</Name>
					<Comment>Количество, кратное которому можно заказывать в 'Заказе поставщику'"</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнятаСПроизводства</Name>
					<Comment>Номенклатура снята с производства</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретПродажи</Name>
					<Comment>Запрет продажи номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретЗакупки</Name>
					<Comment>Запрет закупки номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Comment>Содержит массу брутто в основной единице измерения массы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АртикулДляПоиска</Name>
					<Comment>Артикул для поиска</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Comment>Код товарной номенклатуры внешнеэкономической деятельности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Comment>Ценовая группа номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКПД2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОКПД2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прослеживаемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подакцизный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставНабора</Name>
					<Comment>Состав набора</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ГруппыАналогов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// Модуль формы записи регистра "Сведения о сотрудниках"
//
///////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = Отказ Или РаботаСФормой.НужноОтменитьОткрытиеФормы();
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Источник", НоменклатураИсточник) И НЕ НоменклатураИсточник.Пустая() Тогда
		Если ПустаяСтрока(Запись.ИдентификаторГруппы) Тогда
			Запись.ИдентификаторГруппы =
				ИдентификаторГруппыНоменклатуры(НоменклатураИсточник.АртикулДляПоиска, НоменклатураИсточник.Производитель);
		КонецЕсли;
	ИначеЕсли Параметры.Свойство("ЗначенияЗаполнения") И Параметры.ЗначенияЗаполнения.Свойство("ИдентификаторГруппы") Тогда
		Запись.ИдентификаторГруппы = Параметры.ЗначенияЗаполнения.ИдентификаторГруппы;
	КонецЕсли;
	
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		НастроитьПараметрыВыбораЭлементовФормы();
		УправлениеДиалогомНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда
		ЗаполнитьЗначенияСвойств(Запись, ПолучитьДанныеСсылкиНаНоменклатуру(ВыбранноеЗначение));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Производители = ПрайсЛистыКонтрагентов.ПроизводителиАртикула(Запись.Артикул);
	Элементы.Производитель.СписокВыбора.Очистить();
	
	Для Каждого Производитель Из Производители Цикл
		Элементы.Производитель.СписокВыбора.Добавить(
			Производитель,
			?(Производитель.Пустая(), "<Пустое значение>", Производитель));
	КонецЦикла;
	
	НастроитьПараметрыВыбораЭлементовФормы();
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ТребуетсяОбновитьНоменклатуру = Ложь;
	
	ИдентификаторГруппыТекущейНоменклатуры =
		ИдентификаторГруппыНоменклатуры(Запись.АртикулДляПоиска, Запись.Производитель);
	
		Если ИдентификаторГруппыТекущейНоменклатуры <> Запись.ИдентификаторГруппы 
			И НЕ (ПустаяСтрока(ИдентификаторГруппыТекущейНоменклатуры) ИЛИ ПустаяСтрока(Запись.ИдентификаторГруппы)) Тогда
		ДопПараметры = Новый Структура(
			"ГруппаДляОбъединения,ТекущийИдентификатор",
			ИдентификаторГруппыТекущейНоменклатуры,
			Запись.ИдентификаторГруппы);
		// необходимо объединять группы
		Отказ      = Истина;
		Оповещение = Новый ОписаниеОповещения("ВопросОбОбъединенииГруппАналоговЗавершение", ЭтотОбъект, ДопПараметры);
		
		ТекстВопроса = НСтр("ru = 'Номенклатура с указанным артикулом и производителем уже входит в группу аналогом.
			|Объединить группы?'");
		
		ВариантыОтвета = Новый СписокЗначений;
		ВариантыОтвета.Добавить("АвтоОбъединение"  , "ОБЪЕДИНИТЬ автоматически");
		ВариантыОтвета.Добавить("РучноеОбъединение", "ОБЪЕДИНИТЬ вручную");
		ВариантыОтвета.Добавить("Отмена"           , "Не объединять");
		ПоказатьВопрос(Оповещение, ТекстВопроса, ВариантыОтвета, , , НСтр("ru = 'Объединение групп'"));
		
		Возврат;
	ИначеЕсли ПустаяСтрока(Запись.ИдентификаторГруппы) И НЕ ПустаяСтрока(ИдентификаторГруппыТекущейНоменклатуры) Тогда
		ТребуетсяОбновитьНоменклатуру = Истина;
		Запись.ИдентификаторГруппы    = ИдентификаторГруппыТекущейНоменклатуры;
	ИначеЕсли ПустаяСтрока(ИдентификаторГруппыТекущейНоменклатуры) И ПустаяСтрока(Запись.ИдентификаторГруппы) Тогда
		ТребуетсяОбновитьНоменклатуру = Истина;
		Запись.ИдентификаторГруппы = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
	Если ТребуетсяОбновитьНоменклатуру Тогда
		Оповещение = Новый ОписаниеОповещения("УстановитьИдентификаторГруппыНоменклатуры", ЭтотОбъект);
		ВыполнитьОбработкуОповещения(Оповещение, Запись.ИдентификаторГруппы);
	Иначе
		ЗаписатьНоменклатуруИсточник();
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Проверим аналог на значения ГлавныйПоГруппе и ГлавныйПоПроизводителю
	Если Запись.ГлавныйПоГруппе ИЛИ Запись.ГлавныйПоПроизводителю Тогда
		// Выберем аналоги из группы с установленными значениями ГлавныйПоГруппе и ГлавныйПоПроизводителю.
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ГруппыАналогов.ГлавныйПоГруппе,
		|	ГруппыАналогов.ГлавныйПоПроизводителю,
		|	ГруппыАналогов.ИдентификаторГруппы,
		|	ГруппыАналогов.АртикулДляПоиска,
		|	ГруппыАналогов.Производитель
		|ИЗ
		|	РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
		|ГДЕ
		|	ГруппыАналогов.ИдентификаторГруппы = &ИдентификаторГруппы
		|	И ГруппыАналогов.АртикулДляПоиска <> &АртикулДляПоиска
		|	И (ГруппыАналогов.ГлавныйПоГруппе = ИСТИНА
		|			ИЛИ ГруппыАналогов.ГлавныйПоПроизводителю = ИСТИНА)";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("АртикулДляПоиска", Запись.АртикулДляПоиска);
		Запрос.УстановитьПараметр("ИдентификаторГруппы", Запись.ИдентификаторГруппы);
		ВыборкаВсехАналоговГруппы = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаВсехАналоговГруппы.Следующий() Цикл
			// Прочитаем аналог из группы
			Аналог = РегистрыСведений.ГруппыАналогов.СоздатьМенеджерЗаписи();
			Аналог.АртикулДляПоиска    = ВыборкаВсехАналоговГруппы.АртикулДляПоиска;
			Аналог.ИдентификаторГруппы = ВыборкаВсехАналоговГруппы.ИдентификаторГруппы;
			Аналог.Производитель       = ВыборкаВсехАналоговГруппы.Производитель;
			Аналог.Прочитать();
			
			Если НЕ Аналог.Выбран() Тогда
				Продолжить;
			КонецЕсли;
			
			// Переопределяем значение аналога
			Если Аналог.ГлавныйПоГруппе И Запись.ГлавныйПоГруппе Тогда
				Аналог.ГлавныйПоГруппе = Ложь;
			КонецЕсли;
			
			// Переопределяем значение аналога
			Если Аналог.ГлавныйПоПроизводителю И Запись.ГлавныйПоПроизводителю
				И Аналог.Производитель = Запись.Производитель Тогда
				Аналог.ГлавныйПоПроизводителю = Ложь;
			КонецЕсли;
			
			// Записываем аналог
			Аналог.Записать();
		КонецЦикла;
	КонецЕсли;
	
	НастроитьПараметрыВыбораЭлементовФормы();
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура("РежимВыбора", Истина);
	ОткрытьФорму(
		"Справочник.Номенклатура.ФормаВыбора",
		ПараметрыОткрытия,
		ЭтотОбъект,
		УникальныйИдентификатор,
		,
		,
		,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеАвтоПодбор(
	Элемент,
	Текст,
	ДанныеВыбора,
	ПараметрыПолученияДанных,
	Ожидание,
	СтандартнаяОбработка)
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Отбор"                , Новый Структура);
	ПараметрыПодбора.Вставить("ВыборГруппИЭлементов" , ПредопределенноеЗначение("ИспользованиеГруппИЭлементов.Элементы"));
	ПараметрыПодбора.Вставить("СтрокаПоиска"         , Текст);
	ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.Номенклатура"), ПараметрыПодбора);
	
КонецПроцедуры

&НаКлиенте
Процедура АртикулАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыПодбора = Новый Структура;
	
	Если ЗначениеЗаполнено(Запись.Производитель) Тогда
		
		Отбор = Новый Структура("Производитель", Запись.Производитель);
		ПараметрыПодбора.Вставить("Отбор", Отбор);
		
	КонецЕсли;
	
	ПараметрыПодбора.Вставить("ВыборГруппИЭлементов" , ПредопределенноеЗначение("ИспользованиеГруппИЭлементов.Элементы"));
	ПараметрыПодбора.Вставить("СтрокаПоиска"         , Текст);
	
	ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.Номенклатура"), ПараметрыПодбора);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда
		СтандартнаяОбработка = Ложь;
		ЗаполнитьЗначенияСвойств(Запись, ПолучитьДанныеСсылкиНаНоменклатуру(ВыбранноеЗначение));
		АртикулПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АртикулОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда
		СтандартнаяОбработка = Ложь;
		ЗаполнитьЗначенияСвойств(Запись, ПолучитьДанныеСсылкиНаНоменклатуру(ВыбранноеЗначение));
		АртикулПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АртикулПриИзмененииНаСервере()
	
	Производители = ПрайсЛистыКонтрагентов.ПроизводителиАртикула(Запись.Артикул);
	Элементы.Производитель.СписокВыбора.Очистить();
	
	Для Каждого Производитель Из Производители Цикл
		Элементы.Производитель.СписокВыбора.Добавить(
			Производитель,
			?(Производитель.Пустая(), НСтр("ru = '<Пустое значение>'"), Производитель));
	КонецЦикла;
	
	Запись.АртикулДляПоиска = ОбщегоНазначенияАвтосалонКлиентСервер.ВАртикулДляПоиска(Запись.Артикул);
	
КонецПроцедуры

&НаКлиенте
Процедура АртикулПриИзменении(Элемент)
	
	АртикулПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеСсылкиНаНоменклатуру(СсылкаНаНоменклатуру)
	
	Если ЗначениеЗаполнено(СсылкаНаНоменклатуру) Тогда
		СтруктураНоменклатуры = Новый Структура;
		
		СтруктураНоменклатуры.Вставить("Артикул"         , СсылкаНаНоменклатуру.Артикул);
		СтруктураНоменклатуры.Вставить("Наименование"    , СсылкаНаНоменклатуру.Наименование);
		СтруктураНоменклатуры.Вставить("Производитель"   , СсылкаНаНоменклатуру.Производитель);
		СтруктураНоменклатуры.Вставить("АртикулДляПоиска", СсылкаНаНоменклатуру.АртикулДляПоиска);
	Иначе
		СтруктураНоменклатуры = Новый Структура("Артикул,Наименование,Производитель,АртикулДляПоиска");
	КонецЕсли;
	
	Возврат СтруктураНоменклатуры;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ИдентификаторГруппыНоменклатуры(АртикулДляПоиска, Производитель)
	
	Если ПустаяСтрока(АртикулДляПоиска) Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ГруппыАналогов.ИдентификаторГруппы
	|ИЗ
	|	РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
	|ГДЕ
	|	ГруппыАналогов.АртикулДляПоиска = &АртикулДляПоиска И
	|	ГруппыАналогов.Производитель = &Производитель";
	Запрос.УстановитьПараметр("АртикулДляПоиска", АртикулДляПоиска);
	Запрос.УстановитьПараметр("Производитель"   , Производитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	Иначе
		Возврат РезультатЗапроса.Выгрузить()[0].ИдентификаторГруппы;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьИдентификаторГруппыНоменклатурыНаСервере(НовыйИдентификаторГруппы)
	
	МенеджерЗаписи = РегистрыСведений.ГруппыАналогов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, НоменклатураИсточник);
	
	МенеджерЗаписи.ИдентификаторГруппы = НовыйИдентификаторГруппы;
	
	Попытка
		МенеджерЗаписи.Записать(Истина);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка менеджера записи'"),
       				УровеньЖурналаРегистрации.Ошибка,,,
       				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИдентификаторГруппыНоменклатуры(НовыйИдентификаторГруппы, ДопПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(НовыйИдентификаторГруппы) Тогда
		УстановитьИдентификаторГруппыНоменклатурыНаСервере(НовыйИдентификаторГруппы);
		ОповеститьОбИзменении(НоменклатураИсточник);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНоменклатуруИсточник()
	
	ИД = ИдентификаторГруппыНоменклатуры(НоменклатураИсточник.АртикулДляПоиска, НоменклатураИсточник.Производитель);
	Если ИД = "" И Не ПустаяСтрока(Запись.ИдентификаторГруппы) Тогда
		УстановитьИдентификаторГруппыНоменклатурыНаСервере(Запись.ИдентификаторГруппы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросОбОбъединенииГруппАналоговЗавершение(Ответ, ДопПараметры = Неопределено) Экспорт
	
	Если СтрНачинаетсяС(Ответ, "РучноеОбъединение") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Источник", НоменклатураИсточник);
		
		Если НЕ ЗначениеЗаполнено(НоменклатураИсточник) Тогда
			ПараметрыФормы.Вставить("Источник", ДопПараметры.ТекущийИдентификатор);
		КонецЕсли;
		
		ЗаписатьНоменклатуруИсточник();
		
		ГруппыИсточники = Новый Массив;
		ГруппыИсточники.Добавить(ДопПараметры.ГруппаДляОбъединения);
		
		ПараметрыФормы.Вставить("ГруппыИсточники", ГруппыИсточники);
		
		Описание = Новый ОписаниеОповещения("ЗакрытьФорму", ЭтотОбъект);
		
		ОткрытьФорму(
			"РегистрСведений.ГруппыАналогов.Форма.ФормаДобавленияАналога",
			ПараметрыФормы,
			ЭтотОбъект,
			КлючУникальности,
			,
			,
			Описание,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли СтрНачинаетсяС(Ответ, "АвтоОбъединение") Тогда
		ПрайсЛистыКонтрагентовВызовСервера.
			ОбъединитьГруппыАналогов(ДопПараметры.ТекущийИдентификатор, ДопПараметры.ГруппаДляОбъединения);
		
		ПараметрыОповещения = Новый Структура("ИдентификаторГруппы", ДопПараметры.ТекущийИдентификатор);
		
		Оповестить("ИзмененаГруппаАналогов", ПараметрыОповещения, КлючУникальности);
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Результат, ДопПараметры) Экспорт
	
	Закрыть();
	
КонецПроцедуры

#Область ОбработчикиСлужебногоПрограммногоИнтерфейса

&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	УправлениеДиалогомРегистраСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	УправлениеДиалогомРегистраСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрыОповещения = Новый Структура("ИдентификаторГруппы", Запись.ИдентификаторГруппы);
	Оповестить("ИзмененыДанныеРегистраГруппыАналогов", ПараметрыОповещения, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
